# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [ ]:
import pandas as pd
df_titanic = pd.read_csv('Purchase_data.csv', header=0)
df_titanic.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [3]:
df_titanic.columns

Index(['invoice_number', 'invoice_time', 'store_id', 'product_id',
       'category_id', 'num_item', 'price'],
      dtype='object')

Slice the first two columns using .loc and store the result in a variable called result_1.

In [16]:
result_1 = df_titanic.loc[:,'invoice_number':'invoice_time']
print(result_1)

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [15]:
result_2 = df_titanic.loc[0:1,:]
print(result_2)

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0

   price
0    2.0
1    2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [24]:
result_3 = df_titanic.loc[0:3,['invoice_number','invoice_time','store_id','product_id','category_id']]
print(result_3)

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [25]:
result_4 = df_titanic.loc[[0,3,6],['invoice_time','price']]
print(result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
3  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [30]:
num_rows = df_titanic.shape[0]
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [32]:
last_row = df_titanic.loc[[5381],:]
print(last_row)

      invoice_number  invoice_time store_id  product_id  category_id  \
5381    2.020000e+11  9/5/15 23:38     G619    23030206       210101

      num_item  price
5381       1.0    2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [35]:
avg_price = df_titanic['price'].mean()
print(avg_price)
max_price = df_titanic['price'].max()
print(max_price)

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [41]:
avgerage = df_titanic[['price','num_item']].mean()
avg_price = avgerage['price']
avg_num_items = avgerage['num_item']
print(avg_price)
print(avg_num_items)

3.1920522110741363
1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [58]:

df_titanic['total'] = df_titanic['price'] * df_titanic['num_item']
print(df_titanic.loc[:,'total'])

0       2.0
1       2.0
2       2.0
3       6.0
4       6.0
       ...
5377    3.0
5378    6.0
5379    5.0
5380    4.0
5381    2.0
Name: total, Length: 5382, dtype: float64

What is the avgerage price of the three most expensive purchases?

In [45]:
thtee_most_expensive = df_titanic.sort_values(by='price',ascending=False).head(3)
print(thtee_most_expensive)

      invoice_number   invoice_time store_id  product_id  category_id  \
2979    2.020000e+11  8/21/15 12:14     6666     7070969        70401
4628    2.020000e+11  8/31/15 12:23     6666     7070891        70401
945     2.020000e+11  7/26/15 15:26     G619     7070891        70401

      num_item  price  total
2979       3.0   6.01  18.03
4628       4.0   6.00  24.00
945        1.0   6.00   6.00

How many different products are there?

In [46]:
different_products = df_titanic[''].unique()
print(different_products)

[ 7000300  7070884  7070891  7090363  7000126  7308017 15000231  7071096
  7000133  7071133  7314599  7000294  7313684  7071218  7314612  7090370
 21000782 30000742  7308765  7000140  7070969 21000430  7000034  7000423
 21050107 20098391 30000759 30000766  7000409  7090097  7071102  7071140
  7071164  7000416 21000447 21000379 21000362 30000711  7090462  7090509
  7071331 21050060 21050022  7090455  7090592 23030206  7090493  7071256
  7071249  7090486  7090479  7071232  7090615]

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [49]:
data_frame = df_titanic['total'].describe()
maen = data_frame['mean']
median = data_frame['50%']
data_frame = maen - median
print(data_frame)

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [60]:
df_titanic.drop(columns=['total'], inplace=True)
df_titanic.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [61]:
df_titanic['invoice_time'] = pd.to_datetime(df_titanic['invoice_time'])
print(df_titanic.dtypes)

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

C:\Users\Mostafa\AppData\Local\Temp\ipykernel_1888\1124604819.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [73]:
df_titanic['DOW'] = df_titanic['invoice_time'].dt.day_name()
df_titanic['Month'] = df_titanic['invoice_time'].dt.month_name()
df_titanic.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [76]:
dow_counts = df_titanic['DOW'].value_counts()
wednesday = dow_counts['Wednesday']
print(wednesday)

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [82]:
import pandas as pd
df_titanic = pd.read_csv('Titanic.csv', header=0)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [83]:
df_titanic = df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'})
print(df_titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

Change the index of the df_titanic to the column PasengerID.

In [86]:

print(df_titanic.columns)
df_titanic.set_index('PassengerId', inplace=True)
df_titanic.head()

Index(['PassengerId', 'Pclass', 'Passenger_Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket_Num', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [87]:
passenger_name = df_titanic.loc[896, 'Passenger_Name']
print(passenger_name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [88]:
df_titanic.reset_index(drop=False, inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [89]:
df_titanic.isnull()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
413,False,False,False,False,True,False,False,False,False,True,False
414,False,False,False,False,False,False,False,False,False,False,False
415,False,False,False,False,False,False,False,False,False,True,False
416,False,False,False,False,True,False,False,False,False,True,False
417,False,False,False,False,True,False,False,False,False,True,False

Compute the avg age of passengers ignoring the missing data.

In [90]:
avg_age = df_titanic['Age'].mean()
print(avg_age)

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [ ]:
avg_age = df_titanic['Age'].mean()
df_titanic['Age'].fillna(value=avg_age, inplace=True)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [100]:
df_titanic_sorted = df_titanic.sort_values(by='Age', ascending=False)
oldest_5_passengers = df_titanic_sorted.head(5)
average = oldest_5_passengers['Age'].mean()
print(average)

67.0